HasViewportTransforms Method
 Indicates if the viewport has transforms.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  Since:  2023
 Syntax
  C#
public bool HasViewportTransforms()
  Visual Basic
Public Function HasViewportTransforms As Boolean
  Visual C++
public:
bool HasViewportTransforms()
 Return Value
 True if the viewport has transforms, false otherwise.
 Remarks
 Not all viewports have transforms. For example, viewports for schedules and legends do not have transforms.
 See Also
  Viewport Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →